
context_data = """
ЭКОНОМИКА
Павлова Елена Алексеевна
Схема не особо сложная: ходите на пары, готовитесь, отвечает, получаете плюсы. По поводу аттестаций - списать тяжело, но самые ловкие умеют. Лучше ходить на пары, так как снимает баллы с аттестаций за пропуски. Если с посещением все ок, и вы что-то делали на парах, но баллов не хватает, то может и накинуть

СПЭД
Копытина Екатерина Александровна
Дедлайн - ваше все. Если сдаёте вовремя, то проблем вообще не должно быть. Она отмечает на практике, по поводу пропусков может что-то сказать или снизить балл на атте, но не особо строго к этому относится. Ваша аттестация - это баллы за работы, которые вы делаете дома и ей сдаёте. Лекции вообще лайтовые. Отпускала раньше, не отмечала. Весь материал, который нужен вам, есть в методичке. Так что делаете задание согласно требованиям, которые написаны там, и будет вам счастье. Главное - ВОВРЕМЯ. За то, что сдаёте позже дедлайна, снижает баллы. Плюс это грозит походом на зачёт. Не особо приятная штука, но тем не менее терпимая.

ИСТОРИЯ
Лавлинский Сергей Александрович 
К Лавлинскому можно относиться по-разному, но вспоминать его вы будете до конца учебы точно. Лекции к посещению не обязательны, но крайне желательны — у него отличная память на лица и на экзамене это может сказаться. Семинары пропускать не стоит ни при каких условиях — потом надо будет отрабатывать в конце семестра по пропущенным темам. Отработка может быть в виде доп вопросов на экзамене, может быть отдельным днем.
Аттестации проходят целую пару, он дает вам тест, вы пишите. В среднем, 10 вопросов, из них 8 на выбор ответа из четырех, 2 — развернутый. Часть билетов есть у нас, попозже скинем архивом. Он их меняет не очень часто, но нам попадались и новые (было весело). Коэффициенты у аттестаций разные (первая самая легкая, третья самая сложная), поэтому по среднему арифметическому не получится. Но примерно будет совпадать.
К концу семестра, перед экзаменом, он вывесит на мудл табличку, где будет видно, кому автомат, кому на экзамен.
А, да, если у вас автоматом 3, а вы хотите четыре и идете на экзамен — можете получить и неуд, так что подумайте над этим.
АТАН
Сирота Екатерина Александровна 
Тут, в целом, все достаточно просто. Аттестации бывают по практике и по теории. По теории надо решить пару простых задач на понимание и написать теоремы — на это уходит примерно половины пары, варианты на первую атту скинем.
По практике — просто решаете задачи. Как обычная контрольная в школе, ничего особенного.
Итоговый балл считается так: среднее арифм за теорию и практику за каждую атту (это среднее идет в табель), потом через коэффициенты считается итоговая оценка. Экзамен обязательно, про него расскажем ближе к концу сессии, тк Сирота у нас не вела и не факт, что будет принимать экз у вас.

КУЛЬТУРА РЕЧИ (Деловое общение)
Саломатина Мария Сергеевна
У нас это было два разных предмета — русский язык и основы речевого взаимодействия. У вас по нему Саломатина — это топ. Оч классная женщина и препод. Атты только на практике — она дает задание, вы делаете, профит. У вас должен быть зачет, поэтому достаточно просто набрать 25\50 по каждой атте и наслаждаться жизнью. задания могут быть разные, у нас на первую атту был тест на ударения и произношение, на вторую история развития языка и на третью что-то не очень серьезное. Короче, предмет лафа, как и все зачеты. На лекции можно не ходить, если вам не интересно. На практику (как и на все предметы) ходить стоит хотя бы потому, что отмечает и может потом требовать пропущенные темы

ТОИНФ
Сычев Александр Васильевич 
Теория - Сыч. Аттестация так же проходит во время лекции, может быть в среднем 4-6 вариантов. Его атты испокон веков списываются всеми, но если вы хотите получить реально хорошую оценку, то лучше хоть немного разберитесь в том, что пишете, и не катайте подчистую со шпор; в некоторых местах
пишите своими словами и молитесь богу рандома.
Самодуров Александр Сергеевич
Преподаватель крайне своеобразный, так
как предмет сам по себе не
сложный и легко списываемый, то в теории все должно быть просто. Но будьте готовы к тому, что он будет долго проверять, терять ваши работы. Может не все оценки отправить лектору, отчего у кого-то будет 0 за аттестацию и придется до него добиваться достаточно долго, чтобы исправил. В общем, старайтесь приходить на его пары в дни аттестаций, чтобы не было проблем. Если повезёт, то проблем не будет.
Атты не сложные, делаете то же самое, что делали на практических занятиях.
Есть возможность получить автомат, он высчитывается по среднему баллу за атты.

ФИЗРА
Парни:
Для получения зачёта у нас были такие условия: полная посещаемость с возможностью 5 прогулов, в конце семестра сдать некоторые ГТОшные нормативы. Если сдаёте норматив на 5, это закрывает один пропуск.

Есть альтернативная версия получения зачёта, всё как и в других универах.

Девочки : полная посещаемость (но один раз в месяц можно прогулять),к конце семестра сдаёте нормативы.

ПРОГРАММИРОВАНИЕ
Соломатин Дмитрий Иванович
Теория: Соломатин. скорее всего у вас будет всего 2 аттестации, вместо 3-х, тк по лекциям будете отставать, это норма. Обычно предупреждает за пару недель. Аттестация проходит на лекции, занимает всю пару. Если он видит, что вы не успеваете, или вы сами просите, может задержаться ещё на перерыв. На атте обычно 3 варианта, распределение по которым невозможно предугадать, но обычно оно будет по какой-то по счёту букве фамилии. Например, 1 вариант - буквы а, б, в; 2 вариант - я, ю, э и тд.
Всего будет 5-6 задач, в каждой из которых нужно будет реализовать какой-то определённый метод, делающий\возвращающий что-то. Решение пишете у себя в IDE и копируете в систему с тестом в мудле.(Инога на аттах ему код писали на листочках)))))) Загуглить решение не получится, придётся думать самому. Если списываете у кого-то код и пишете 1 в 1(иногда даже не 1 в 1) с одинаковыми ошибками, обнуляет обе работы.
Практика. Просто сдавайте проги до дедлайна и всё у вас будет в порядке. Если не успели, то можно будет донести позже, но придётся договариваться с преподом.
По проге есть автомат, который определяется рекомендацией от препода по практике (средний бал за сданные проги) и тем, как вы написали теоретические атты. Для получения 5 придётся к концу семестра сдать простую игру (Flappy bird, морской бой и тп)



Форма одежды
Форма свободная, можете ходить хоть в костюме, хоть в джинсах, самое главное чистыми и опрятными. НО НЕ В ШОРТАХ.

Тест по английскому
Тест по английскому будет проходить 1 сентября, точное время мы сообщим позже, ближе к сентябрю. Он нужен только для того, чтобы распределить вас по группам, чтобы вам было комфортно учиться с людьми вашего уровня английского. (Рекомендуем для теста по английскому повторить времена) Тест по английскому не списывать! Пишите именно то, что знаете или вы гораздо усложните свою жизнь.

Разделение на группы
На ваше разделение на группы будет влиять тест по английскому. Также 1 сентября у вас будет возможность донести деканату информацию о том, что вы хотите быть в одной группе со своим другом, они примут это к сведению, но не факт, что вы все-таки окажетесь вместе. Мы (хелперы) не знаем в какой группе будет какой уровень, за это отвечают преподаватели и своего секрета они не рассказывают - так что вопросы как попасть в ту или иную группу просим нам не задавать.
На нашем направлении (ИСиТ) 6 групп (1, 2, 3, 4, 5, 6), но ещё в каждой группе есть подгруппы (1.1, 1.2, 2.1, 2.2, 3.1, 3.2, 4.1, 4.2, 5.1, 5.2, 6.1, 6.2). В разных подгруппах одной группы уровень английского тоже разный.
ВАЖНО ОТМЕТИТЬ, что 1 группа может быть не самой умной по английскому, а 6 не самой глупой.
ПИШИТЕ ТЕСТ ЧЕСТНО, НЕ СПИСЫВАЙТЕ

Перевод в другую группу
Если вы все таки написали тест по английскому не своими силами и поняли, что вы не осиливаете, то в течение недели после 1 сентября у вас будет возможность перевестись в другую группу при следующих условиях:
1. В другой группе уровень английского +- как в вашей
2. Вы договорились с преподавателями по английскому и они дали вам разрешение
3. В другой группе есть свободное место которое вы можете занять.
! ПРОСТО ТАК ПЕРЕВОДИТЬСЯ ПОТОМУ ЧТО ПОТОМУ НЕ НАДО !

Расписание
Расписание у вас составлено по группам, и оно ещё делиться на подгруппы.
Всем потоком у вас будут проходить дистанционные лекции, очные лекции будут проводиться по ~3 группы в аудитории, по группам у вас будут семинары и практики, обычно на семинарах вы сидите всей своей группой, а на практике подгруппой
Также в расписание пара делиться горизонтально (вверху - числитель, внизу знаменатель) то есть одну неделю у вас пары по числителю, а другую по знаменателю
1 - неделя числитель, 2-неделя знаменатель, 3-неделя числитель, 4-знаменатель и так далее

Профсоюз
В профсоюз могут вступить все: и платники, и бюджетники. ! ЗАНИМАТЬСЯ ТАМ НИЧЕМ НЕ НАДО, ВЫ ПРОСТО ТАМ ЕСТЬ И ПОЛУЧАЕТЕ ПЛЮШКИ !
Чтобы вступить бюджетники пишут заявление и у них со стипендии забирают 2%, а платники пишут заявление и вносят 200 рублей за весь год и все. Написать заявление вы сможете в сентябре, вас
соберут в актовом зале по этому поводу.
Если ты состоишь в профсоюзе, то можешь получать разные плюшки - билеты в батутный, кино, лазертаг, бассейн, квесты и т.д. Делать для этого ничего не надо, кроме как прийти и записаться на эти самые плюшки. ВАЖНО ОТМЕТИТЬ, что также ещё есть Путевки: зимой - Казань, Питер; летом - Крым, Сочи. Чтобы их получить вы пишите заявление, а профсоюз уже их вам выдаёт (не всегда можно попасть в список этот)
Также бюджетники могут получать мат.помощь раз в семестр, она может быть от 1000 и до 5000, для того чтобы получить мат помощь надо будет заполнить заявление и собрать 3 подписи.

Спортивные кружки, активы, волонтеры
Об этом вам расскажут позже либо в беседе, либо соберут в актовом зале

Канцелярия
История:
Лекция - 96 листов
Скорее всего у вас будет еще предмет Основы российской государственности, у нас такого не было. Возьмите тетрадь 48/96 листов.
Введение в программирование - 48 листов (возможно кому-то она может не пригодиться)
 атематический анализ:
Лекция - 90 листов размер А4
Практика - 90 листов размер А4
Да, желательно иметь отдельные тетради по лекции и практие. Почему именно размер А4? Просто потому что удобно и в
разы больше места. Почему 90 листов? Матанализ у вас будет длиться в течении 3 семестров.
Теоретические основы информатики:
Практика - 24 листа
Теория - 24 листа
СПЭД - 12 листов (Может быть такое, что она вам и не понадобится, т.к. всё основную работу вы будете делать на компьютерах/ноутбуках). СПЭД - система подготовки электронных документов. По факту вас научат оформлять курсовые и работать в экселе.
 Экономика и финансовая грамотность - 48 листов
Иностранный язык - 48 листов
Деловое общение и культура речи - 24 листа (но возможно она не пригодится, т.к. у вас будет рабочая тетрадь. Подробнее вам расскажет преподаватель на паре)
P.s. советую брать блочные тетради, т.к. если закончатся страницы, то можно будет докупить блоки и вставить. Или можете просто взять тетради на кольцах.

‼ Форма одежды ‼
Форма свободная, можете ходить хоть в костюме, хоть в джинсах, самое главное чистыми и опрятными. НО НЕ В ШОРТАХ.

Если у вас еще остались вопросы по обучению, то не стесняйтесь спрашивать, мы (хелперы) ответим на них
Кабинеты ‼
В главном корпусе, есть главная часть, где учится ФКН и ещё есть пристройка (что где мы вам покажем 1 сентября), ГЛАВНОЕ ЗАПОМНИТЕ, что если в расписание рядом с кабинетом стоит буква П, например 308П, то пара проходит в пристройке, в противном – в корпусе ФКН
"""